import numpy as np
from matplotlib import pyplot as plt

data = np.array([
    [1, 74.332465],
    [2, 37.143505],
    [3, 24.976028],
    [4, 20.245485],
    [5, 18.234112],
    [6, 14.715311],
    [7, 13.696036],
    [8, 12.032454],
    [9, 11.692883],
    [10, 11.335742],
    [11, 9.121372],
    [12, 8.548014],
    [13, 8.197252],
    [14, 8.047275],
    [15, 6.692412],
    [16, 5.796517],
    [17, 5.470461],
    [18, 5.272775],
    [19, 11.136030],
    [20, 5.151257],
    [21, 5.034221],
    [22, 4.527965],
    [23, 8.245607],
    [24, 3.703197],
    [25, 3.656850],
    [26, 3.464491],
    [27, 3.411932],
    [28, 10.693908],
])

y_pract = []
for i in data:
    y_pract.append(data[0][1] / i[1])

x = np.arange(1, 29)
y_teor = x

plt.plot(x, y_teor, label='Теор.')
plt.plot(x, y_pract, label='Практ.')
plt.legend()
plt.grid()
plt.title('Зависимость ускорения от числа исполнителей')
plt.ylabel('Ускорение, раз')
plt.xlabel('Количество исполнителей, шт.')
plt.show()
