import numpy as np
from matplotlib import pyplot as plt

data = np.array([
    [1, 137.212255],
    [2, 72.610457],
    [3, 50.678244],
    [4, 39.857912],
    [5, 36.022686],
    [6, 32.244974],
    [7, 27.328168],
    [8, 24.533725],
    [9, 21.076217],
    [10, 18.056046],
    [11, 14.769144],
    [12, 13.855936],
    [13, 12.498948],
    [14, 11.673640],
    [15, 11.075279],
    [16, 10.271840],
    [17, 9.654781],
    [18, 9.544956],
    [19, 9.489656],
    [20, 8.556723],
    [21, 8.321113],
    [22, 7.475905],
    [23, 7.349897],
    [24, 7.272982],
    [25, 7.216984],
    [26, 7.102561],
    [27, 6.931818],
    [28, 6.866326],
])

y_pract = []
for i in data:
    y_pract.append(data[0][1] / i[1])

x = np.arange(1, 29)
y_teor = x

plt.plot(x, y_teor, label='Теор.')
plt.plot(x, y_pract, label='Практ.')
plt.legend()
plt.grid()
plt.title('Зависимость ускорения от числа исполнителей')
plt.ylabel('Ускорение, раз')
plt.xlabel('Количество исполнителей, шт.')
plt.show()
